package com.angeya.pig.util;

/**
 * @ Decs:
 * @ Author: angeya
 * @ Date: 2021/3/28
 */

public class Const {

    private Const(){};

    /**
     * 姓
     */
    public static String[] FAMILY_NAME = {"赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋",
            "沈", "韩", "杨", "朱", "秦", "尤", "许", "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶",
            "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章", "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁",
            "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳", "欧阳", "公孙", "诸葛", "夏", "李", "徐",
            "司马", "宇文", "衮", "何"};
    /**
     * 名
     */
    public static String[] FIRST_NAME = {"安", "杰", "蝶", "海", "军", "明",  "彦", "青", "甜", "彪", "丽", "娜", "燕",
            "冉", "奇", "锐", "新", "伟", "兰", "秀", "丝" ,"雨" , "纹", "冰", "颖", "亮", "剑", "景", "宇", "浩", "菲",
            "应", "英", "后", "票", "离", "鹅", "刚", "返", "轴", "州", "粥", "红", "章", "户", "湖", "贺", "哦", "晨",
            "辰", "嗄", "想", "比", "能", "年", "拟", "故",  "龙", "合", "发", "分", "富", "从", "王", "无", "炮", "书",
            "钱", "将", "近", "啦", "点", "地", "回", "号", "大", "传", "萌", "门", "猛", "姜", "掌", "骄", "交", "终",
            "愁", "末", "磨", "迷", "眯", "密", "黑", "空", "可", "片", "时", "镇"};
    /**
     * 城市
     */
    public static String[] CITY = {"上海市", "北京市", "深圳市", "重庆市", "苏州市", "成都市", "杭州市", "武汉市", "南京市",
            "济南市", "西安市", "合肥市", "南通市", "福州市", "天津市", "宁波市", "青岛市", "无锡市", "长沙市", "郑州市", "佛山市",
            "泉州市", "济南市", "西安市", "阜阳市", "六安市", "桐城市", "淮南市", "淮北市", " 池州市", "马鞍山市"};
    /**
     * 大学
     */
    public static String[] UNIVERSITY = {"北京大学", "清华大学", "中国科学技术大学", "复旦大学", "南京大学", "浙江大学",
            "上海交通大学", "西安交通大学", "华中科技大学", "武汉大学", "哈尔滨工业大学", "南开大学", "吉林大学", "北京航天航空大学",
            "北京师范大学", "四川大学", "山东大学", "兰州大学", "北京邮电大学", "中山大学", "中国人民大学", "同济大学",
            "西北工业大学", "天津大学", "大连理工大学", "北京外国语大学", "东南大学", "中国电子科技大学", "重庆大学", "中国农业大学"};
}
